using System.Collections.ObjectModel;
using Header.Utils.Models;

namespace Header.Utils;

public static class Global
{
    public static ObservableCollection<Students> Std { get; } =
    [
        new Students(1, "Азизбекова Айсел", false, 24, "01, 03b, 05, 08b, 10b, 12, 15b, 17, 18b, 20, 22b, 23b, 24, 25b, 26b, 27, 28b, 29, 30b, 31, 01b, 03, 05b, 08"),  
        new Students(2, "Астахов Алексей Сергеевич", false, 3, "02b, 05b, 09"),  
        new Students(3, "Бакаева Алёна Александровна", false, 17, "01b, 02, 04b, 06, 07b, 09b, 10, 12b, 14, 15b, 16, 18, 19b, 20b, 21, 23, 25b"),  
        new Students(4, "Балакин Артемий Игоревич", false, 24, "01, 02b, 03, 05b, 06, 07, 08b, 09b, 10, 11b, 12, 13b, 14, 15, 16b, 17b, 18, 19, 20b, 21, 22, 23b, 24b, 25"),  
        new Students(5, "Бобаренко Денис Михайлович", false, 36, "01b, 02, 03b, 04, 05, 06b, 07, 08, 09b, 10b, 11, 12b, 13, 14b, 15, 16, 17b, 18, 19b, 20, 21b, 22, 23, 24b, 25, 26b, 27, 28, 29b, 30, 01b, 02, 03, 04b, 05b, 06"),  
        new Students(6, "Герейханов Намик Алимадетович", false, 36, "01, 02b, 03, 04b, 05, 06b, 07b, 08, 09, 10b, 11, 12, 13b, 14, 15b, 16, 17, 18b, 19, 20b, 21, 22, 23b, 24, 25b, 26, 27b, 28, 29, 30b, 01, 02b, 03, 04, 05b, 06"),  
        new Students(7, "Головач Дарья Дмитриевна", false, 12, "02b, 04, 06b, 08, 10b, 12, 14, 16b, 18, 20, 22b, 24"),  
        new Students(8, "Горбов Никита Алексеевич", true, 0, ""),  
        new Students(9, "Горбунов Илья Васильевич", true, 0, ""),  
        new Students(10, "Гузев Алексей Васильевич", true, 0, ""),  
        new Students(11, "Дмитриенко Глеб Михайлович", false, 7, "01b, 03, 05b, 07, 09b, 11, 13b"),  
        new Students(12, "Елисеев Даниил Алексеевич", false, 34, "01, 02b, 03, 04b, 05, 06b, 07, 08b, 09, 10, 11b, 12, 13, 14b, 15, 16b, 17, 18, 19b, 20, 21b, 22, 23, 24b, 25, 26, 27b, 28, 29, 30b, 01, 02, 03b, 04"),  
        new Students(13, "Залевская Диана Сергеевна", true, 0, ""),  
        new Students(14, "Иконникова Вера Денисовна", false, 27, "01b, 02, 03, 04b, 05, 06b, 07, 08, 09b, 10, 11b, 12, 13, 14b, 15, 16, 17b, 18, 19, 20b, 21, 22b, 23, 24, 25b, 26, 27b"),  
        new Students(15, "Моисеева Анастасия Игоревна", false, 24, "01, 02b, 03, 04, 05b, 06, 07b, 08, 09, 10b, 11, 12b, 13, 14, 15b, 16, 17, 18b, 19, 20, 21b, 22, 23b"),  
        new Students(16, "Рассолов Игорь Георгиевич", false, 22, "01b, 02, 03, 04b, 05, 06b, 07, 08b, 09, 10, 11b, 12, 13, 14b, 15, 16, 17b, 18, 19, 20b, 21, 22"),  
        new Students(17, "Трипольский Александр Александрович", false, 5, "03b, 07, 11b, 15, 19b"),  
        new Students(18, "Устенко Данил Алексеевич", true, 0, ""),  
        new Students(19, "Ушакова Евгения Александровна", true, 0, ""),  
        new Students(20, "Хворост Данил Денисович", true, 0, ""),  
        new Students(21, "Шарко Вероника Михайловна", false, 9, "02b, 05, 08b, 11, 14b, 17, 20, 23b, 26"),  
        new Students(22, "Шевченко Евгений Евгеньевич", false, 44, "01b, 02, 03b, 04, 05b, 06, 07b, 08, 09b, 10, 11b, 12, 13b, 14, 15b, 16, 17b, 18, 19b, 20, 21b, 22, 23b, 24, 25b, 26, 27b, 28, 29b, 30, 01, 02b, 03, 04b, 05, 06b, 07, 08b, 09, 10b, 11, 12b, 13, 14b"),  
        new Students(23, "Щаденко Илья Григорьевич", false, 22, "01, 02b, 03, 04, 05b, 06, 07, 08b, 09, 10, 11b, 12, 13, 14b, 15, 16, 17b, 18, 19, 20b, 21, 22")  
    ];

    public static ObservableCollection<Disciplines> Disc { get; } =
    [
        new Disciplines(1, "Физическая культура"),
        new Disciplines(2, "Информационные системы и программирование"),
        new Disciplines(3, "Стандартизация, сертификация и техническая документация"),
        new Disciplines(4, "Теория вероятности и математическая статистика"),
        new Disciplines(5, "Основы безопасности жизнедеятельности"),
        new Disciplines(6, "Экономика отрасли"),
    ];
}